In [13]:
import sqlite3
import pandas as pd

In [4]:
dir_db= (r'C:\Users\andre\Desktop\The Bridge\ALUMNO\thebridgenov2020\SQL_taller\chinook.db')
conn=sqlite3.connect(dir_db)

In [5]:
#creamos el cursor
cursor = conn.cursor()

In [6]:
query = """
SELECT*
FROM tracks
"""

In [7]:
mi_query = cursor.execute(query)
mi_query = cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")

In [8]:
mi_query.fetchall()

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',),
 ('films',),
 ('new_table',),
 ('nueva_tabla',)]

In [9]:
pd.read_sql_query(query, con=conn)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,None,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99
...,...,...,...,...,...,...,...,...,...
3498,3499,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,343,2,24,None,286741,4718950,0.99
3499,3500,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",344,2,24,Franz Schubert,139200,2283131,0.99
3500,3501,"L'orfeo, Act 3, Sinfonia (Orchestra)",345,2,24,Claudio Monteverdi,66639,1189062,0.99
3501,3502,"Quintet for Horn, Violin, 2 Violas, and Cello ...",346,2,24,Wolfgang Amadeus Mozart,221331,3665114,0.99
3502,3503,Koyaanisqatsi,347,2,10,Philip Glass,206005,3305164,0.99

In [20]:
query_4="""
SELECT c.FirstName "Cliente", c.Country, e.FirstName "Empleado", iTotal
FROM invoices i
JOIN customers c ON i.customerId = c.customersId
JOIN employees e ON e.EmployeeId = c.supportRepId
"""

In [21]:
pd.read_sql_query(query_4, con= conn)

DatabaseError: Execution failed on sql '
SELECT c.FirstName "Cliente", c.Country, e.FirstName "Empleado", iTotal
FROM invoices i
JOIN customers c ON i.customerId = c.customersId
JOIN employees e ON e.EmployeeId = c.supportRepId
': no such column: iTotal

In [26]:
query5="""
SELECT t.name,ii.InvoiceLineId,i.invoiceId
FROM tracks t
JOIN invoice_items ii ON ii.trackId=t.trackId
JOIN invoices i ON i.invoiceId = ii.invoiceId
"""

In [27]:
pd.read_sql_query(query5, con= conn)

                               Name  InvoiceLineId  InvoiceId
0               Experiment In Terra            531         98
1                 Take the Celestra            532         98
2                 Shout It Out Loud            649        121
3                  Calling Dr. Love            650        121
4                          Strutter            651        121
...                             ...            ...        ...
2235           Esporrei Na Manivela           1537        284
2236  No Fundo Do Quintal Da Escola           1538        284
2237                 Que Luz Ã‰ Essa           1539        284
2238          The Power Of Equality           1540        284
2239   Mellowship Slinky In B Major           1541        284

[2240 rows x 3 columns]

In [28]:
query6="""
SELECT t.name "Nombre Cancion",mt.name "Formato"
FROM tracks t
JOIN media_types mt ON t.mediaTypeId = mt.mediaTypeId
JOIN albums al ON t.albumId = al.albumId
"""

In [55]:
pd.read_sql_query(query6, con= conn)

,Nombre Cancion,Formato
0,For Those About To Rock (We Salute You),MPEG audio file
1,Put The Finger On You,MPEG audio file
2,Let's Get It Up,MPEG audio file
3,Inject The Venom,MPEG audio file
4,Snowballed,MPEG audio file
...,...,...
3498,"Concerto for Violin, Strings and Continuo in G...",Purchased AAC audio file
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Protected AAC audio file
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Protected AAC audio file
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Protected AAC audio file
3502,Koyaanisqatsi,Protected AAC audio file

In [32]:
query7="""
SELECT t.name "Nombre Cancion",mt.name "Formato", 
FROM tracks t
JOIN media_types mt ON t.mediaTypeId = mt.mediaTypeId
JOIN albums al ON t.albumId = al.albumId
JOIN genres g ON g.genreId= T.genreId
"""

In [33]:
pd.read_sql_query(query7, con= conn)

DatabaseError: Execution failed on sql '
SELECT t.name "Nombre Cancion",mt.name "Formato",
FROM tracks t
JOIN media_types mt ON t.mediaTypeId = mt.mediaTypeId
JOIN albums al ON t.albumId = al.albumId
JOIN genres g ON g.genreId= g.genreId
': near "FROM": syntax error

In [38]:
query7="""
SELECT p.Name, COUNT(pt.trackId)
FROM playlists p
LEFT JOIN playlist_track pt ON p.PlaylistId =pt.PlaylistId
GROUP BY p.PlaylistId 
"""

In [39]:
pd.read_sql_query(query7, con= conn)

                          Name  COUNT(pt.trackId)
0                        Music               3290
1                       Movies                  0
2                     TV Shows                213
3                   Audiobooks                  0
4                   90â€™s Music               1477
5                   Audiobooks                  0
6                       Movies                  0
7                        Music               3290
8                 Music Videos                  1
9                     TV Shows                213
10             Brazilian Music                 39
11                   Classical                 75
12   Classical 101 - Deep Cuts                 25
13  Classical 101 - Next Steps                 25
14  Classical 101 - The Basics                 25
15                      Grunge                 15
16         Heavy Metal Classic                 26
17                 On-The-Go 1                  1

In [44]:
query8="""
SELECT e.FirstName, SUM(i.Total) "Ventas"
FROM employees e
JOIN customers c ON e.EmployeeId= C.SupportRepId
JOIN invoices i ON i.CustomerId=C.CustomerId
GROUP BY e.EmployeeId
"""

In [45]:
pd.read_sql_query(query8, con= conn)

  FirstName  Ventas
0      Jane  833.04
1  Margaret  775.40
2     Steve  720.16

In [52]:
query9="""
SELECT e.FirstName, SUM(i.Total) "Ventas"
FROM employees e
JOIN customers c ON e.EmployeeId= C.SupportRepId
JOIN invoices i ON i.CustomerId=C.CustomerId
WHERE i.InvoiceDate LIKE "2009%"
GROUP BY e.EmployeeId
ORDER BY Ventas DESC
LIMIT 1
"""
pd.read_sql_query(query9, con= conn)

  FirstName  Ventas
0     Steve  164.34

In [58]:
query10="""
SELECT ar.Name, SUM(ii.UnitPrice) "VENTAS"
FROM artists ar
JOIN albums al ON al.artistId= ar.artistId
JOIN tracks t ON al.albumId= t.albumId
JOIN invoice_items ii ON t.trackId =ii.trackId
GROUP BY ar.ArtistId
ORDER BY VENTAS DESC
LIMIT 3
"""
pd.read_sql_query(query10, con= conn)

          Name  VENTAS
0  Iron Maiden  138.60
1           U2  105.93
2    Metallica   90.09

In [59]:
conn.close()